In [1]:
#Connect jupyter to mysql
import mysql.connector
mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123")
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x0000020E10E1DC08>

In [2]:
#Test connection
if (mydb):
    print("Connection Successful")
    
else:
    print("Connection Unsuccessful")

Connection Successful

In [3]:
#Create database named exra
import mysql.connector
mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123")
#object mycursor
mycursor =mydb.cursor()
mycursor.execute("Create database Extra")

DatabaseError: 1007 (HY000): Can't create database 'extra'; database exists

In [1]:
#Creating 2 tables. Cost price and Barcode
import mysql.connector
mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123", database="extra")
mycursor =mydb.cursor()
mycursor.execute("Create table Add_on(Cost_Price varchar(200), Barcode int(20))")

In [5]:
#("Show database) 
import mysql.connector
mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123")
mycursor =mydb.cursor()

mycursor.execute("Show databases")
for db in mycursor:
    print(db)

('data',)
('extra',)
('information_schema',)
('mydatabase',)
('mysql',)
('new_schema',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [1]:
#Show tables
import mysql.connector
mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123", database="extra")
mycursor =mydb.cursor()
mycursor.execute("Show tables")

for tb in mycursor:
    print(tb)

('add_on',)
('cost_price',)

In [6]:
#Insert command
import mysql.connector

mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123", database="mydatabase")
mycursor =mydb.cursor()

sqlform = "INSERT INTO book2(Chips, Quantity) VALUES (%s, %s)"

cost = [
    ("Conachos", 101),
    ("Spookies", 102),
    ("Cracka Snack", 103),
    ("Chippa", 104),
    ("Bigga", 105),
    ("Flyers", 106),
    ("Stylos", 107),
    ("Bubbles", 108),
    ("Labamba", 109),
    ("Fritos", 110)
]

mycursor.executemany(sqlform, cost)

mydb.commit()

In [ ]:
#Insert command
import mysql.connector

mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123", database="mydatabase")
mycursor =mydb.cursor()

sqlform = "ALTER TABLE book2 ADD Quantity_Value Varchar(50)"


mycursor.execute(sqlform)

mydb.commit()

In [1]:
import mysql.connector
import pandas as pd

mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123", database="mydatabase")
mycursor =mydb.cursor()

df = pd.read_sql_query("SELECT * From book2 WHERE Cooldrink = ''",mydb) # Importing a SQL Data Query into a Pandas DataFrame
df

alter = df.to_csv('Chips.csv', index = False)
new = pd.read_csv("Chips.csv")
new

Empty DataFrame
Columns: [Chips, Quantity, Price, Cooldrink, Quantity_[0], Price_[0], Chocolate, Quantity_[1], Price_[1], Pies, Quantity_[2], Price_[2], Fruit, Quantity_[3], Price_[3], Cupcakes, Quantity_[4], Price_[4], Veggies, Quantity_[5], Price_[5], Quantity_Value]
Index: []

[0 rows x 22 columns]

In [1]:
#LIMIT 5
import mysql.connector
import pandas as pd

mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123", database="mydatabase")
mycursor =mydb.cursor()

df = pd.read_sql_query("SELECT Chips,Quantity,Price FROM mydatabase.book2 LIMIT 5;",mydb)
alter = df.to_csv('Chips.csv', index = False)
new = pd.read_csv("Chips.csv")
new

      Chips  Quantity   Price
0     Simba         2   R4,50
1      Lays         4   R6,00
2  Willards         6   R5,00
3  Pringles         8  R10,00
4   Doritos        10   R6,00

In [1]:
import mysql.connector
import pandas as pd

mydb =mysql.connector.connect(host="localhost", user="root", passwd="Taahir123", database="mydatabase")
mycursor =mydb.cursor()

df = pd.read_sql_query("SELECT Chips,Quantity,Price FROM mydatabase.book2;",mydb)
alter = df.to_csv('Chips.csv', index = False)
new = pd.read_csv("Chips.csv")
new

           Chips  Quantity   Price
0          Simba         2   R4,50
1           Lays         4   R6,00
2       Willards         6   R5,00
3       Pringles         8  R10,00
4        Doritos        10   R6,00
5       Nik Naks        14   R2,00
6       IQ Foods         9   R1,50
7        Walkers        10   R2,00
8          Truda        12   R2,00
9       Conachos       101     NaN
10      Spookies       102     NaN
11  Cracka Snack       103     NaN
12        Chippa       104     NaN
13         Bigga       105     NaN
14        Flyers       106     NaN
15        Stylos       107     NaN
16       Bubbles       108     NaN
17       Labamba       109     NaN
18        Fritos       110     NaN
19      Conachos       101     NaN
20      Spookies       102     NaN
21  Cracka Snack       103     NaN
22        Chippa       104     NaN
23         Bigga       105     NaN
24        Flyers       106     NaN
25        Stylos       107     NaN
26       Bubbles       108     NaN
27       Labamba       109     NaN
28        Fritos       110     NaN
29      Conachos       101     NaN
30      Spookies       102     NaN
31  Cracka Snack       103     NaN
32        Chippa       104     NaN
33         Bigga       105     NaN
34        Flyers       106     NaN
35        Stylos       107     NaN
36       Bubbles       108     NaN
37       Labamba       109     NaN
38        Fritos       110     NaN